tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87k22_tdd.h
#define TMR12IE                       1649
#define TMR7GIE                       1650
#define PIR5                          1651
#define TMR4IF                        1652
#define TMR5IF                        1653
#define TMR6IF                        1654
#define TMR7IF                        1655
#define TMR8IF                        1656
#define TMR10IF                       1657
#define TMR12IF                       1658
#define TMR7GIF                       1659
#define CCP1CON                       1660
#define CCP1M0                        1661
#define CCP1M                         1662
#define CCP1M1                        1663
#define CCP1M2                        1664
#define CCP1M3                        1665
#define CCP1Y                         1666
#define DC1B                          1667
#define DC1B0                         1668
#define CCP1X                         1669
#define DC1B1                         1670
#define P1M                           1671
#define P1M0                          1672
#define P1M1                          1673
#define CCPR1L                        1674
#define CCPR1H                        1675
#define ECCP1DEL                      1676
#define P1DC                          1677
#define P1DC0                         1678
#define P1DC1                         1679
#define P1DC2                         1680
#define P1DC3                         1681
#define P1DC4                         1682
#define P1DC5                         1683
#define P1DC6                         1684
#define P1RSEN                        1685
#define PSS1BD0                       1686
#define PSS1BD                        1687
#define PSS1BD1                       1688
#define PSS1AC                        1689
#define PSS1AC0                       1690
#define PSS1AC1                       1691
#define ECCP1AS                       1692
#define ECCP1AS0                      1693
#define ECCP1AS1                      1694
#define ECCP1AS2                      1695
#define ECCP1ASE                      1696
#define ADCON2                        1697
#define ADCS0                         1698
#define ADCS                          1699
#define ADCS1                         1700
#define ADCS2                         1701
#define ACQT0                         1702
#define ACQT                          1703
#define ACQT1                         1704
#define ACQT2                         1705
#define ADFM                          1706
#define ADCON1                        1707
#define CHSN0                         1708
#define CHSN                          1709
#define CHSN1                         1710
#define CHSN2                         1711
#define VNCFG                         1712
#define CHSN3                         1713
#define VCFG                          1714
#define VCFG01                        1715
#define VCFG0                         1716
#define VCFG11                        1717
#define VCFG1                         1718
#define TRIGSEL                       1719
#define TRIGSEL0                      1720
#define TRIGSEL1                      1721
#define ADCON0                        1722
#define ADON                          1723
#define nDONE                         1724
#define GO_nDONE                      1725
#define NOT_DONE                      1726
#define GODONE                        1727
#define GO_DONE                       1728
#define DONE                          1729
#define GO_NOT_DONE                   1730
#define GO                            1731
#define CHS0                          1732
#define CHS                           1733
#define CHS1                          1734
#define CHS2                          1735
#define CHS3                          1736
#define CHS4                          1737
#define ADRESL                        1738
#define ADRESH                        1739
#define SSP1CON2                      1740
#define SEN1                          1741
#define SSP1CON2_SEN                  1742
#define ADMSK11                       1743
#define SSP1CON2_RSEN                 1744
#define RSEN1                         1745
#define SSP1CON2_ADMSK1               1746
#define SSP1CON2_PEN                  1747
#define ADMSK21                       1748
#define PEN1                          1749
#define SSP1CON2_ADMSK2               1750
#define ADMSK31                       1751
#define RCEN1                         1752
#define SSP1CON2_RCEN                 1753
#define SSP1CON2_ADMSK3               1754
#define SSP1CON2_ACKEN                1755
#define ACKEN1                        1756
#define ADMSK41                       1757
#define SSP1CON2_ADMSK4               1758
#define ACKDT1                        1759
#define ADMSK51                       1760
#define SSP1CON2_ACKDT                1761
#define SSP1CON2_ADMSK5               1762
#define SSP1CON2_ACKSTAT              1763
#define ACKSTAT1                      1764
#define GCEN1                         1765
#define SSP1CON2_GCEN                 1766
#define SSP1CON1                      1767
#define SSP1CON1_SSPM0                1768
#define SSPM01                        1769
#define SSP1CON1_SSPM                 1770
#define SSP1CON1_SSPM1                1771
#define SSPM11                        1772
#define SSP1CON1_SSPM2                1773
#define SSPM21                        1774
#define SSPM31                        1775
#define SSP1CON1_SSPM3                1776
#define SSP1CON1_CKP                  1777
#define CKP1                          1778
#define SSPEN1                        1779
#define SSP1CON1_SSPEN                1780
#define SSPOV1                        1781
#define SSP1CON1_SSPOV                1782
#define WCOL1                         1783
#define SSP1CON1_WCOL                 1784
#define SSP1STAT                      1785
#define BF1                           1786
#define SSP1STAT_BF                   1787
#define UA1                           1788
#define SSP1STAT_UA                   1789
#define SSP1STAT_R_NOT_W              1790
#define RW1                           1791
#define NOT_W                         1792
#define SSP1STAT_R                    1793
#define SSP1STAT_nW                   1794
#define RW                            1795
#define SSP1STAT_READ_WRITE           1796
#define SSP1STAT_nWRITE               1797
#define SSP1STAT_I2C_READ             1798
#define SSP1STAT_R_W                  1799
#define SSP1STAT_NOT_WRITE            1800
#define SSP1STAT_R_nW                 1801
#define SSP1STAT_S                    1802
#define START                         1803
#define SSP1STAT_I2C_START            1804
#define START1                        1805
#define STOP                          1806
#define SSP1STAT_P                    1807
#define STOP1                         1808
#define SSP1STAT_I2C_STOP             1809
#define SSP1STAT_D                    1810
#define SSP1STAT_D_NOT_A              1811
#define NOT_A                         1812
#define SSP1STAT_D_A                  1813
#define SSP1STAT_D_nA                 1814
#define SSP1STAT_NOT_ADDRESS          1815
#define SSP1STAT_nA                   1816
#define DA1                           1817
#define DA                            1818
#define SSP1STAT_I2C_DAT              1819
#define SSP1STAT_nADDRESS             1820
#define SSP1STAT_DATA_ADDRESS         1821
#define SSP1STAT_CKE                  1822
#define CKE1                          1823
#define SSP1STAT_SMP                  1824
#define SMP1                          1825
#define SSP1ADD_MSK0                  1826
#define MSK01                         1827
#define SSP1ADD                       1828
#define SSP1ADD_MSK1                  1829
#define MSK11                         1830
#define SSP1ADD_MSK2                  1831
#define MSK21                         1832
#define MSK31                         1833
#define SSP1ADD_MSK3                  1834
#define SSP1ADD_MSK4                  1835
#define MSK41                         1836
#define MSK51                         1837
#define SSP1ADD_MSK5                  1838
#define SSP1ADD_MSK6                  1839
#define MSK61                         1840
#define SSP1ADD_MSK7                  1841
#define MSK71                         1842
#define SSP1MSK                       1843
#define SSP1MSK_MSK0                  1844
#define SSP1MSK_MSK1                  1845
#define SSP1MSK_MSK2                  1846
#define SSP1MSK_MSK3                  1847
#define SSP1MSK_MSK4                  1848
#define SSP1MSK_MSK5                  1849
#define SSP1MSK_MSK6                  1850
#define SSP1MSK_MSK7                  1851
#define SSP1BUF                       1852
#define SSPBUF                        1853
#define T2CON                         1854
#define T2CKPS0                       1855
#define T2CKPS                        1856
#define T2CKPS1                       1857
#define TMR2ON                        1858
#define T2OUTPS0                      1859
#define T2OUTPS                       1860
#define T2OUTPS1                      1861
#define T2OUTPS2                      1862
#define T2OUTPS3                      1863
#define PR2                           1864
#define TMR2                          1865
#define T1CON                         1866
#define TMR1ON                        1867
#define T1CON_RD16                    1868
#define NOT_T1SYNC                    1869
#define nT1SYNC                       1870
#define T1OSCEN                       1871
#define T1CON_SOSCEN                  1872
#define T1CKPS0                       1873
#define T1CKPS                        1874
#define T1CKPS1                       1875
#define TMR1CS0                       1876
#define TMR1CS                        1877
#define T1RD16                        1878
#define TMR1CS1                       1879
#define TMR1L                         1880
#define TMR1H                         1881
#define RCON                          1882
#define BOR                           1883
#define NOT_BOR                       1884
#define nBOR                          1885
#define POR                           1886
#define nPOR                          1887
#define NOT_POR                       1888
#define PD                            1889
#define nPD                           1890
#define NOT_PD                        1891
#define nTO                           1892
#define TO                            1893
#define NOT_TO                        1894
#define nRI                           1895
#define NOT_RI                        1896
#define RI                            1897
#define NOT_CM                        1898
#define CM                            1899
#define nCM                           1900
#define SBOREN                        1901
#define IPEN                          1902
#define WDTCON                        1903
#define SWDTEN                        1904
#define SWDTE                         1905
#define ULPSINK                       1906
#define ULPEN                         1907
#define SRETEN                        1908
#define ULPLVL                        1909
#define REGSLP                        1910
#define IPR5                          1911
#define CCH05                         1912
#define TMR4IP                        1913
#define CCH15                         1914
#define TMR5IP                        1915
#define TMR6IP                        1916
#define EVPOL05                       1917
#define TMR7IP                        1918
#define EVPOL15                       1919
#define TMR8IP                        1920
#define TMR10IP                       1921
#define TMR12IP                       1922
#define TMR7GIP                       1923
#define OSCCON                        1924
#define SCS0                          1925
#define SCS                           1926
#define SCS1                          1927
#define HFIOFS                        1928
#define OSTS                          1929
#define IRCF                          1930
#define IRCF0                         1931
#define IRCF1                         1932
#define IRCF2                         1933
#define IDLEN                         1934
#define SPBRGH1                       1935
#define T0CON                         1936
#define T0PS                          1937
#define T0PS0                         1938
#define T0PS1                         1939
#define T0PS2                         1940
#define PSA                           1941
#define T0SE                          1942
#define T0CS                          1943
#define T08BIT                        1944
#define TMR0ON                        1945
#define TMR0L                         1946
#define TMR0H                         1947
#define STATUS                        1948
#define C                             1949
#define CARRY                         1950
#define DC                            1951
#define ZERO                          1952
#define Z                             1953
#define OV                            1954
#define OVERFLOW                      1955
#define N                             1956
#define NEGATIVE                      1957
#define FSR2L                         1958
#define PLUSW2                        1959
#define PREINC2                       1960
#define POSTDEC2                      1961
#define POSTINC2                      1962
#define INDF2                         1963
#define FSR1L                         1964
#define PLUSW1                        1965
#define PREINC1                       1966
#define POSTDEC1                      1967
#define POSTINC1                      1968
#define INDF1                         1969
#define WREG                          1970
#define FSR0L                         1971
#define PLUSW0                        1972
#define PREINC0                       1973
#define POSTDEC0                      1974
#define POSTINC0                      1975
#define INDF0                         1976
#define INTCON3                       1977
#define INT1IF                        1978
#define INT1F                         1979
#define INT2IF                        1980
#define INT2F                         1981
#define INT3F                         1982
#define INT3IF                        1983
#define INT1E                         1984
#define INT1IE                        1985
#define INT2IE                        1986
#define INT2E                         1987
#define INT3E                         1988
#define INT3IE                        1989
#define INT1P                         1990
#define INT1IP                        1991
#define INT2IP                        1992
#define INT2P                         1993
#define INTCON2                       1994
#define RBIP                          1995
#define INT3IP                        1996
#define INT3P                         1997
#define TMR0IP                        1998
#define T0IP                          1999
#define INTEDG3                       2000
#define INTEDG2                       2001
#define INTEDG1                       2002
#define INTEDG0                       2003
#define RBPU                          2004
#define NOT_RBPU                      2005
#define nRBPU                         2006
#define INTCON                        2007
#define RBIF                          2008
#define INT0F                         2009
#define INT0IF                        2010
#define T0IF                          2011
#define TMR0IF                        2012
#define RBIE                          2013
#define INT0E                         2014
#define INT0IE                        2015
#define T0IE                          2016
#define TMR0IE                        2017
#define PEIE                          2018
#define PEIE_GIEL                     2019
#define GIEL                          2020
#define GIE_GIEH                      2021
#define GIE                           2022
#define GIEH                          2023
#define PRODL                         2024
#define PRODH                         2025
#define TABLAT                        2026
#define TBLPTRL                       2027
#define TBLPTRH                       2028
#define PCL                           2029
#define PCLATH                        2030
#define PCH                           2031
#define SP0                           2032
#define STKPTR                        2033
#define SP1                           2034
#define SP2                           2035
#define SP3                           2036
#define SP4                           2037
#define STKUNF                        2038
#define STKOVF                        2039
#define STKFUL                        2040
#define TOSL                          2041
#define TOSH                          2042

#endif // _PIC18F87K22_H_
